##ER图与UML图##
#####ER图：实体-联系图(Entity-Relation Diagram)
######ER图提供了表示实体（即数据对象）、属性和联系的方法，用来描述现实世界的概念模型
构成E-R图的基本要素是实体、属性和联系，其表示方法为：
实体型：用矩形表示，矩形框内写明实体名
属性：用椭圆形或圆角矩形表示，并用无向边将其与相应的实体连接起来；多值属性由双线连接；主属性名称下加下划线；
联系：用菱形表示，菱形框内写明联系名，并用无向边分别与有关实体连接起来，同时在无向边旁标上联系的类型
在E-R图中要明确表明1对多关系，1对1关系和多对多关系。
#####UML: 统一建模语言(Unified Modeling Language)
###### UML立足于对事物的实体、性质、关系、结构、状态和动态变化过程的全程描述和反映。
**UML系统开发中有三个主要的模型：**
- 功能模型：从用户的角度展示系统的功能，包括用例图。
- 对象模型：采用对象，属性，操作，关联等概念展示系统的结构和基础，包括类别图、对象图。
- 动态模型：展现系统的内部行为。包括序列图，活动图，状态图。

UML由模型元素(Model Element)、图(Diagram)、视图(View)和通用机制(General Mechanism)等几个部分组成。
区分UML模型和UML图是非常重要的，UML图，包括用例图、协作图、活动图、序列图、部署图、构件图、类图、状态图，是模型中信息的图形表达方式，但是UML模型独立于UML图存在。

1. 用例图:用例图由参与者（Actor）、用例（Use Case）、系统边界、箭头，作用组成，用画图的方法来完成
**用例图主要回答了两个问题：1、是谁用软件。2、软件的功能。从用户的角度描述了系统的功能，并指出各个功能的执行者，强调用户的使用者，系统为执行者完成哪些功能。**
2. 类图：类图是描述系统中的类，以及各个类之间的关系的静态视图。
3. 对象图：与类图极为相似，它是类图的实例，对象图显示类的多个对象实例，而不是实际的类。它描述的不是类之间的关系，而是对象之间的关系
4. 活动图：描述用例要求所要进行的活动，以及活动间的约束关系，有利于识别并行活动。
5. 状态图：描述类的对象所有可能的状态，以及事件发生时状态的转移条件，可以捕获对象、子系统和系统的生命周期。状态图是对类图的补充。
6. 流程图：圆角矩形表示“开始”与“结束”。矩形表示行动方案、普通工作环节用，菱形表示问题判断或判定（审核/审批/评审）环节，用平行四边形表示输入输出，箭头代表工作流方向
7. 协作图：和序列图相似，显示对象间的动态合作关系。可以看成是类图和顺序图的交集，协作图建模对象或者角色，以及它们彼此之间是如何通信的。如果强调时间和顺序，则使用序列图;如果强调上下级关系，则选择协作图;这两种图合称为交互图。
8. 序列图（顺序图）：序列图是用来显示参与者如何以一系列顺序的步骤与系统的对象交互的模型。顺序图可以用来展示对象之间是如何进行交互的。顺序图将显示的重点放在消息序列上，即强调消息是如何在对象之间被发送和接收的。
9. 构件图：描述代码构件的物理结构以及各种构建之间的依赖关系。
10. 配置图：用来建模系统的物理部署。